"""
Задано площу кільця й радіус зовнішнього кола. Визначити радіус внутрішнього кола.
Вхідні дані

Задано два дійсних числа: площа кільця і радіус зовнішнього кола, шо не перевищує 100.
Вихідні дані

Вивести радіус внутрішнього кола з 2 десятковими знаками.
Приклад
Вхідні дані #1

50.2655 5

Вихідні дані #1

3.00


Посилання на розв'язок: https://www.eolymp.com/uk/submissions/14189952
"""


import math 


s, r = [float(d) for d in input().split()]

radius_min = math.sqrt(r**2 - s / math.pi)
print(f"{radius_min:.2f}")

